Revit 2024 API
ITransactionFinalizer.OnCommitted Method
 This method is called at the end of committing a transaction
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
void OnCommitted(
	Document document,
	string strTransactionName
)
Visual Basic
Sub OnCommitted ( _
	document As Document, _
	strTransactionName As String _
)
Visual C++
void OnCommitted(
	Document^ document,
	String^ strTransactionName
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document associated with the transaction
strTransactionName
Type: System.String
 The transaction's name
See Also
ITransactionFinalizer Interface
Autodesk.Revit.DB Namespace